# -*- coding: utf-8 -*-
# Import the library
from czml import czml
#一带一路国家
obor_array=["中国" , "蒙古" , "俄罗斯" , "印度尼西亚" , "泰国" , "马来西亚" , "越南" , "新加坡" , "菲律宾" , "缅甸" , "柬埔寨" , "老挝" , "文莱" , 
"东帝汶" , "乌克兰" , "白俄罗斯" , "格鲁吉亚" , "阿塞拜疆" , "亚美尼亚" , "摩尔多瓦" , "印度" , "巴基斯坦" , "孟加拉国" , "斯里兰卡" , "阿富汗" , 
"尼泊尔" , "马尔代夫" , "不丹" , "沙特阿拉伯" , "阿联酋" , "阿曼" , "伊朗" , "土耳其" , "以色列" , "埃及" , "科威特" , "伊拉克" , "卡塔尔" , "约旦" , "黎巴嫩" , "巴林" , 
"也门共和国" , "叙利亚" , "巴勒斯坦" , "波兰" , "罗马尼亚" , "捷克共和国" , "斯洛伐克" , "保加利亚" , "匈牙利" , "拉脱维亚" , "立陶宛" , "斯洛文尼亚"  ,
"爱沙尼亚" , "克罗地亚"  , "阿尔巴尼亚" , "塞尔维亚" , "马其顿" , "波黑" , "黑山" , "哈萨克斯坦" , "乌兹别克斯坦" , "土库曼斯坦" , "吉尔吉斯斯坦" , "塔吉克斯坦"]

obor_lng=[116.406612 , 106.920481 , 37.619697 , 106.845599 , 100.992541 , 101.975766 , 108.277199 , 103.819836 , 120.984219 , 
95.956223 , 104.990963 , 102.614429 , 114.727669 , 125.727539 , 31.16558 , 27.953389 , 43.356892 , 47.576927 , 45.038189 , 
28.369885 , 78.96288 , 69.345116 , 90.356331 , 79.861243 , 67.709953 , 84.124008 , 73.5361034 , 90.433601 , 1.489012 , 53.847818 , 
55.923255 , 53.688046 , 35.243322 , 34.851612 , 30.802498 , 47.481766 , 43.679291 , 51.183884 , 36.238414 , 35.86228 , 50.5577 , 
48.516388 , 38.996815 , 35.233154 , 19.145136 , 24.96676 , 15.472962 , 19.699024 , 25.48583 , 19.503304 , 56.879635 , 23.881275 , 
14.995463 , 25.013607 , 15.2 , 20.168331 , 44.01652 , 21.745275 , 18.4130763 , 19.37439 , 66.923684 , 64.585262 , 59.556278 , 
74.766098 , 71.276093]

obor_lat=[39.904186 , 47.919624 , 55.75561 , -6.2087634 , 15.870032 , 4.210484 , 14.058324 , 1.352083 , 14.599512 , 
21.913965, 12.565679 , 17.962769 , 4.535277 , -8.874217 , 48.379433 , 53.709807 , 42.315407 , 40.143105 , 40.069099 , 47.411631 ,
20.593684, 30.375321 , 23.684994 , 6.927079 , 33.93911 , 28.394857 , 1.977247 , 27.514162 , 48.443854 , 23.424076 , 21.512583 ,
32.427908, 38.963745 , 31.046051 , 26.820553 , 29.31166 , 33.223191 , 25.354826 , 30.585164 , 33.854721 , 26.0667 , 15.552727 ,
34.802075 , 31.952162 , 51.919438 , 45.943161 , 49.817492 , 48.669026 , 42.733883 , 47.162494 , 24.603189 , 55.169438 , 46.151241 , 
58.595272 , 45.1 , 41.153332 , 21.005859 , 41.608635 , 43.8562586 , 42.708678 , 48.019573 , 41.377491 , 38.969719 , 41.20438 , 38.861034]
#print len(obor_array)


# Initialize a document
doc = czml.CZML()

# Create and append the document packet
packet1 = czml.CZMLPacket(id='document', version='1.0')
doc.packets.append(packet1)
for i in range(0, len(obor_array)):
    """Create and append a billboard&label packet"""
    packet_ele = czml.CZMLPacket()
    packet_ele.id = obor_array[i]
    """不需要billboard
    bb = czml.Billboard(scale=0.7, show=True)
    bb.color = {'rgba': [255, 0, 0, 50]}
    bb.image = 'http://localhost:8080/Apps/CZML_python/startpoint.png'
    packet_ele.billboard = bb
    """
    ps = czml.Position()
    ps._cartographicDegrees = [obor_lng[i], obor_lat[i], 2000]
    packet_ele.position = ps
    # 最方便的是，对json格式的最大支持，CZML的任何属性都可以只是一个json字符串
    #定义位置的另一种方法
    #packet2.position = {'cartographicDegrees': [116, 39, 2000]}
    # 添加Label
    # 小灯泡能将粘贴的字符串 变成字典型，识别其格式
    lb = czml.Label()
    lb.scale = 1.0
    lb.horizontalOrigin = "LEFT"
    lb.show = "true"
    lb.text = obor_array[i]
    packet_ele.label = lb
    doc.packets.append(packet_ele)



# Write the CZML document to a file
obor_filename = "country_name.czml"
doc.write(obor_filename)

"""
packet2.label= dict(fillColor={"rgba": [255, 255, 0, 255]}, font="bold 10pt Segoe UI Semibold", horizontalOrigin="LEFT",
                    outlineColor={
                        "rgba": [
                            0, 0, 0, 255
                        ]
                    }, pixelOffset={
        "cartesian2": [
            10.0, 0.0
        ]
    }, scale=1.0, show='true', style="FILL", text="Vehicle", verticalOrigin="CENTER")
"""